k1 = 0
k2 = 0
k5 = 0
k10 = 0
k50 = 0
k100 = 0
k500 = 0

s = int(input("Введите сумму: "))

while s > 0:
    while s >= 500:
        s -= 500
        k500 += 1
    else:
        print("Покупатель отдаст: ", k500, "купюр(у) по 500р.")
    while s >= 100:
        s -= 100
        k100 += 1
    else:
        print("Покупатель отдаст: ", k100, "купюр(у) по 100р.")
    while s >= 50:
        s -= 50
        k50 += 1
    else:
        print("Покупатель отдаст: ", k50, "купюр(у) по 50р.")
    while s >= 10:
        s -= 10
        k10 += 1
    else:
        print("Покупатель отдаст: ", k10, "купюр(у) по 10р.")
    while s >= 5:
        s -= 5
        k5 += 1
    else:
        print("Покупатель отдаст: ", k5, "купюр(у) по 5р.")
    while s >= 2:
        s -= 2
        k2 += 1
    else:
        print("Покупатель отдаст: ", k2, "купюр(у) по 2р.")
    while s >= 1:
        s -= 1
        k1 += 1
    else:
        print("Покупатель отдаст: ", k1, "купюр(у) по 1р.")
